---
kind: property
id: P:Autodesk.Revit.DB.Electrical.WireSet.IsEmpty
source: html/00bf3073-468d-ab4a-15d4-01196f916437.htm
---
# Autodesk.Revit.DB.Electrical.WireSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.